// 🔹 กำหนดคำถามของแต่ละเล่มและแต่ละหน้า
  final Map<String, Map<int, List<Map<String, dynamic>>>> bookQuestions = {
    "หนูจี๊ดติดจอ": {
      6: [
        {
          "type": "choice",
          "question": "แปร๊นแปร๊น คือสัตว์ชนิดอะไร?",
          "options": ["ช้าง", "ม้า", "วัว", "สิงโต"],
          "answerIndex": 0
        }
      ],
      8: [
        {
          "type": "choice",
          "question": "หนูจี๊ดกับแปร๊นแปร๊นชวนใครไปดูทีวี?",
          "options": ["กระรอก", "กระเบน", "กระต่าย", "กระสา"],
          "answerIndex": 2
        }
      ],
      11: [
        {
          "type": "choice",
          "question": "หนูจี๊ดใช้เวลากับอะไรเยอะเกินไป?",
          "options": ["อ่านหนังสือ", "เล่นกับเพื่อน", "จ้องหน้าจอทีวี", "วิ่งเล่น"],
          "answerIndex": 2
        }
      ],
      15: [
        {
          "type": "open",
          "question": "ถ้าลูกเป็นหนูจี๊ด ลูกจะแก้ปัญหาการติดจออย่างไร?",
        }
      ]
    },
    "มาดูสิ": {
      5: [
        {
          "type": "choice",
          "question": "เด็กหญิงในเรื่องกำลังมองอะไร?",
          "options": ["ต้นไม้", "รั้ว", "ผีเสื้อ", "นก"],
          "answerIndex": 1
        }
      ]
    }
  };